app/controllers/api/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "photo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "kjhkhj"], ["author_id", 1], ["photo_id", 3], ["created_at", 2016-10-03 22:13:19 UTC], ["updated_at", 2016-10-03 22:13:19 UTC]]
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save